# NoConstraintsToLinks1 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LinkFailures..::..NoConstraintsToLinks1 Property
BuiltInFailures..::..LinkFailures Class See Also
---
Constraints may not be created to linked instances using Shared Locations. Constraints will be removed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoConstraintsToLinks1 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoConstraintsToLinks1 As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoConstraintsToLinks1 {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LinkFailures Class
Autodesk.Revit.DB Namespace